package day14.work2;

public class work1 {
    public static void main(String[] args) {
        /*
        * 1.请说出异常的继承体系
        * Throwable体系：
        * Error:严重错误Error，无法通过处理的错误，只能事先避免，好比绝症。
        * Exception:表示异常，异常产生后程序员可以通过代码的方式纠正，使程序继续运行，
        * 是必须要处理的。好 比感冒、阑尾炎
        *
        * 2.请说出你对错误(Error)的理解
        * Error是工程师无法处理的，无法通过代码的方式纠正，只好尽量避免
        *
        * 3.请说出你对编译异常的理解
        * 编译时期异常:checked异常。在编译时期,就会检查,如果没有处理异常,则编译失败。(如日期格式化异常)
        *
        * 4.请说出你对运行时异常(RuntimeException)的理解
        * 运行时期异常:runtime异常。在运行时期,检查异常.在编译时期,运行异常不会编译器检测(不报错)。(如数学异 常)
        *
        * */
    }
}
