package day09.work;

public class work1 {
            /*
            1. 什么是接口，如何定义接口？
            接口，是Java语言中的一种引用类型，是方法的集合
            定义：
            public interface 接口名称{
                抽象方法
                默认方法
                静态方法
                私有方法
            }
            2. 什么叫做多态，条件是什么？
            指同一行为，有多种不同的表现形式
            前提：1.继承或者实现【二选一】
                  2.方法的重写【意义体现：不重写，无意义】
                  3.父类引用指向子类对象【格式体现】
            3. 使用多态特性，带来了什么样的好处？
            增强方法的扩展性和复用性。
            4. 使用多态特性，注意什么样的弊端？
            不能调用子类特有方法，必须向下转型
            */
}
